Revit 2027 API
ParameterTypeId.RbsBuildingConstructionclass Property
 "Building Infiltration Class"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RbsBuildingConstructionclass { get; }
Public Shared ReadOnly Property RbsBuildingConstructionclass As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RbsBuildingConstructionclass {
	ForgeTypeId^ get ();
}
static member RbsBuildingConstructionclass : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace